# Databases Lab: the basics of SQL queries 01/10/2025

## Task 0: Setting up the environment

For this lecture we are going to use a very minimal database interaction tool called `sqlite3`. It is a standard python library to interact with databases using a python interface.

Import libraries

In [1]:
import sqlite3
import pandas as pd

Connect to the database of choice

In [2]:
connection = sqlite3.connect("restaurant.db")

Create a cursor object to interact with the database

In [3]:
cur = connection.cursor()

Helper function to print the results of a query

In [4]:
def show_results(cur):
    results = cur.fetchall()
    colnames = [desc[0] for desc in cur.description]
    df = pd.DataFrame(results, columns=colnames)
    return df

## Task 1: Familiarize yourself with the database

Let's take a look at the ER-Schema of the database we are going to use today:

![ER-Schema](./images/ERrest.drawio.png)

Before we start it is important to identify the tables in the database, their attributes and the relationships among them.

## Task 2: Start querying

Main SQL operators:
* **SELECT** operator: used to select columns in tables
* **FROM** operator: used to select tables in databases
* **WHERE** operator: used to filter rows according to appropriate conditions

**SELECT** and **FROM** in particular are the core building blocks of all retrieval queries on databases, therefore they will be *ALWAYS* present in all queries you are going to write today. 

Note: the **AS** keyword is used to rename a column or table within a query with an alias of choice.

Query: retrieve all entries of the Foods table

In [8]:
cur.execute("""SELECT * FROM foods;

""")

show_results(cur)

    id                     name  price
0    1         Margherita Pizza    8.5
1    2            Diavola Pizza   10.0
2    3                Spaghetti    9.0
3    4                  Lasagna   11.5
4    5              Mixed Salad    6.0
5    6                 Tiramisu    5.5
6    7            Mineral Water    2.0
7    8                 Espresso    1.5
8    9    Risotto alla Milanese   12.0
9   10  Parmigiana di Melanzane    9.5
10  11      Tagliatelle al Ragù   10.5
11  12               Bruschetta    4.0
12  13            Caprese Salad    7.0
13  14     Frittura di Calamari   13.0
14  15              Panna Cotta    5.0
15  16        Cannolo Siciliano    4.5

Query: retrieve all entries of the Foods table where the price is > than 10

In [9]:
cur.execute("""select * from foods where price<10;

""")

show_results(cur)

    id                     name  price
0    1         Margherita Pizza    8.5
1    3                Spaghetti    9.0
2    5              Mixed Salad    6.0
3    6                 Tiramisu    5.5
4    7            Mineral Water    2.0
5    8                 Espresso    1.5
6   10  Parmigiana di Melanzane    9.5
7   12               Bruschetta    4.0
8   13            Caprese Salad    7.0
9   15              Panna Cotta    5.0
10  16        Cannolo Siciliano    4.5

Additional query operators:

* The **ORDER BY** operator in SQL is used to sort the result set of a query by one or more columns, either in ascending (**ASC**) or descending (**DESC**) order. By default, sorting is in ascending order.

* The **LIMIT** operator is used to restrict the number of rows returned by a query. It is often used in combination with **ORDER BY** to retrieve only the top *N* results according to the specified sorting criterion.

* The **DISTINCT** keyword is used to return only unique values in the result set. It is mainly applied to columns in a **SELECT** statement.

Query: retrieve all entries of the foods table with price greater than 10 and sort them in descending order of price

In [12]:
cur.execute(""" select * from foods where price>10 ORDER BY price DESC;

""")

show_results(cur)

   id                   name  price
0  14   Frittura di Calamari   13.0
1   9  Risotto alla Milanese   12.0
2   4                Lasagna   11.5
3  11    Tagliatelle al Ragù   10.5

Query: retrieve all distinct locations of the dining tables in the restaurant

In [ ]:
cur.execute("""select DISTINCT location from DiningTables;

""")

show_results(cur)

       location
0         Patio
1           Bar
2  Private Room

The **WHERE** clause can support more complex conditions, for example:

* **AND**, **OR** logical operators used to concatenate multiple conditions
* **LIKE** operator for substring matching  (e.g., `name LIKE "Ma%"`)
* **BETWEEN** operator to check for value ranges (e.g., `price BETWEEN 5 AND 15`)
* **IN** operator to check for multiple specific values (e.g., `price IN (5, 10, 15)`)
* **IS NULL** or **IS NOT NULL** operators to check if specific fields exist (e.g., `description IS NOT NULL`)
* **NOT** logical operator which can be used in combination with any of the previous operators to negate conditions


Note: if you need to concatenate logical conditions you can use parentheses to ensure they are executed correctly

Query: Show foods whose name contains an "m" or an "M" and whose price is between 5 and 10

In [ ]:
cur.execute("""

""")

show_results(cur)

## Task 3: Aggregate functions and grouping

There are several aggregator functions in SQL, the most common ones are:
* **COUNT**
* **SUM**
* **AVG**
* **MIN**
* **MAX**

They are used inside the **SELECT** statement to compute aggregate values over a set of rows.

They go hand in hand with another important SQL statement: the **GROUP BY** operator, which is used to group rows that have the same values in specified columns in order to allow for aggregation functions to be used in a grouped fashion.

Query: Count the number of dining tables in each location

In [ ]:
cur.execute("""

""")

show_results(cur)

In [ ]:
cur.execute("""

""")

show_results(cur)

Query: retrieve the average capacity of dining tables in each location

In [ ]:
cur.execute("""

""")

show_results(cur)

## Task 4: Joining Tables

When working with relational databases it is common to need to retrieve data from multiple tables.

This is done via the **JOIN** operator, which allows to combine rows from two or more tables based on a specific column in common between them.

Example: let's take a look at the DiningTables and Orders tables.

In [ ]:
cur.execute("""

""")

show_results(cur)

In [ ]:
cur.execute("""

""")

show_results(cur)

Let's **JOIN** them

In [ ]:
cur.execute("""

""")

show_results(cur)

Query: retrieve the number of orders for each distinct location in the restaurant.

In [ ]:
cur.execute("""

""")

show_results(cur)

## Query Exercises

Query Exercise 1: retrieve, for each distinct date in the Orders table, the total number of unique orders placed that day.

In [ ]:
cur.execute("""

""")

show_results(cur)

Query Exercise 2: retrieve id, name, surname, and email of all clients whose email address contains the *"icloud"* substring.

In [ ]:
cur.execute("""

""")

show_results(cur)

Query Exercise 3: retrieve, for each location in the restaurant, its total capacity, defined as the sum of the seating capacities of all tables assigned to that location.

In [ ]:
cur.execute("""
            
""")

show_results(cur)

Query Exercise 4: retrieve the average of the individual prices of all food items on the menu of the restaurant.

In [ ]:
cur.execute("""

""")

show_results(cur)

Query Exercise 5: Retrieve order id, table id, date and location of all orders placed between '2025-09-04' and '2025-09-08' (extremes included). Recall that one table may be associated with multiple orders.

In [ ]:
cur.execute("""

""")

show_results(cur)

Query Exercise 6: Retrieve the order id and the total price of each order in the database. Recall that each order may contain multiple food items, and that the total price of an order is given by the sum of the prices of all food items in it, multiplied by their respective quantities.

In [ ]:
cur.execute("""

""")

show_results(cur)

Query Exercise 7: Retrieve the number of distinct orders in which each food item appears. Report both the food id, name and the number of orders in which it appears.

In [ ]:
cur.execute("""

""")

show_results(cur)

Query Exercise 8: Retrieve food id, name and number of times they were ordered of the 3 foods which have been ordered the most times in the restaurant. Note: each food can be ordered more than once in the same order.

In [ ]:
cur.execute("""

""")

show_results(cur)

Query Exercise 9: Retrieve name, surname and total expenditure of the $3$ clients that have spent the most in the restaurant. Recall that each client may have placed multiple orders which may contain multiple food items in them.

In [ ]:
cur.execute("""

""")

show_results(cur)

Query Exercise 10: retrieve the total expenditure in the restaurant for each of the locations on '2025-09-09'.

In [ ]:
cur.execute("""

""")

show_results(cur)